'use client';

import { useEffect, useRef } from 'react';

const ConsoleMessage = () => {
  const hasLogged = useRef(false);

  useEffect(() => {
    if (hasLogged.current) return;
    hasLogged.current = true;

    const asciiArt = `
██   ██ ███████ ██      ██       ██████      ██████  ███████ ██    ██ ███████ ██       ██████  ██████  ███████ ██████  ██
██   ██ ██      ██      ██      ██    ██     ██   ██ ██      ██    ██ ██      ██      ██    ██ ██   ██ ██      ██   ██ ██
███████ █████   ██      ██      ██    ██     ██   ██ █████   ██    ██ █████   ██      ██    ██ ██████  █████   ██████  ██
██   ██ ██      ██      ██      ██    ██     ██   ██ ██       ██  ██  ██      ██      ██    ██ ██      ██      ██   ██   
██   ██ ███████ ███████ ███████  ██████      ██████  ███████   ████   ███████ ███████  ██████  ██      ███████ ██   ██ ██
`;
    console.log(
      `%c${asciiArt}`,
      'color: #8b5cf6; font-family: monospace; font-weight: bold;',
    );

    console.log(
      '%c👀 Looks like you are interested in the code!\n' +
        'Here is the repo to fulfill your curiosity: %chttps://github.com/rlukas2/portfolio-dev\n\n' +
        "%c⭐ Don't forget to give it a star!",
      'font-size: 14px;',
      'font-size: 14px; color: #3b82f6; text-decoration: underline;',
      'font-size: 14px; color: #fbbf24;',
    );
  }, []);

  return null;
};

export default ConsoleMessage;
